## Terraform Plan — Staging

<details>
<summary>Click to expand plan output</summary>

```hcl
data.aws_ssm_parameter.api_token: Reading...
data.aws_ecr_repository.api[0]: Reading...
data.aws_ecr_repository.worker[0]: Reading...
module.ecs_service_api.aws_cloudwatch_log_group.service: Refreshing state... [id=/ecs/exam-costa-staging-api]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:cluster/exam-costa-staging-cluster]
module.sqs_messages.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/371670420772/exam-costa-staging-messages-dlq]
module.network.aws_vpc.main: Refreshing state... [id=vpc-0e90fbc5e8e8a5c85]
module.iam_api_task_role.aws_iam_role.this: Refreshing state... [id=exam-costa-staging-api-task-role]
module.iam_ecs_execution_role.aws_iam_role.this: Refreshing state... [id=exam-costa-staging-ecs-execution-role]
module.iam_worker_task_role.aws_iam_role.this: Refreshing state... [id=exam-costa-staging-worker-task-role]
data.aws_ssm_parameter.api_token: Read complete after 0s [id=/exam-costa/staging/api/token]
data.aws_caller_identity.current: Reading...
module.network.data.aws_region.current: Reading...
module.network.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.ecs_service_worker.aws_cloudwatch_log_group.service: Refreshing state... [id=/ecs/exam-costa-staging-worker]
data.aws_caller_identity.current: Read complete after 0s [id=371670420772]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.main: Refreshing state... [id=exam-costa-staging-cluster]
module.s3_messages.aws_s3_bucket.this: Refreshing state... [id=exam-costa-staging-messages-371670420772]
module.iam_ecs_execution_role.aws_iam_role_policy_attachment.managed[0]: Refreshing state... [id=exam-costa-staging-ecs-execution-role-20260329015646686000000001]
module.sqs_messages.aws_sqs_queue.main: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/371670420772/exam-costa-staging-messages]
aws_cloudwatch_metric_alarm.sqs_queue_depth[0]: Refreshing state... [id=exam-costa-staging-sqs-queue-depth]
module.iam_api_task_role.aws_iam_role_policy.inline["ssm_access"]: Refreshing state... [id=exam-costa-staging-api-task-role:ssm_access]
module.iam_api_task_role.aws_iam_role_policy.inline["sqs_send"]: Refreshing state... [id=exam-costa-staging-api-task-role:sqs_send]
data.aws_ecr_repository.api[0]: Read complete after 1s [id=exam-costa-api]
module.ecs_service_api.aws_ecs_task_definition.main: Refreshing state... [id=exam-costa-staging-api]
data.aws_ecr_repository.worker[0]: Read complete after 1s [id=exam-costa-worker]
module.s3_messages.aws_s3_bucket_versioning.this: Refreshing state... [id=exam-costa-staging-messages-371670420772]
module.iam_worker_task_role.aws_iam_role_policy.inline["s3_upload"]: Refreshing state... [id=exam-costa-staging-worker-task-role:s3_upload]
module.iam_worker_task_role.aws_iam_role_policy.inline["sqs_receive"]: Refreshing state... [id=exam-costa-staging-worker-task-role:sqs_receive]
module.s3_messages.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=exam-costa-staging-messages-371670420772]
module.ecs_service_worker.aws_ecs_task_definition.main: Refreshing state... [id=exam-costa-staging-worker]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-0c123a58aa86aea8f]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-03898eaa9da231f81]
aws_security_group.worker_service: Refreshing state... [id=sg-07cdbe8b53a7063fb]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-0c32b7878c1c5951d]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0a381f0f1850757c2]
module.network.aws_route_table.public: Refreshing state... [id=rtb-06eadb7d30845dd78]
module.network.aws_internet_gateway.main: Refreshing state... [id=igw-083b25fbba0b450ba]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0d91fd33b6caef2b2]
aws_security_group.alb: Refreshing state... [id=sg-0524fca80c9d9b705]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:targetgroup/exam-costa-staging-alb-tg/58d39abc4e254769]
module.network.aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-02bbc64b2a2ab4203]
module.network.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-06eadb7d30845dd781080289494]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0352834312be427e7]
aws_security_group.api_service: Refreshing state... [id=sg-0a580bfd5d5983c92]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0be6ca6017593f87b]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d7ea2bdc2b5f7be1]
module.alb.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:loadbalancer/app/exam-costa-staging-alb/62fe1bbf5714eb3c]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-004a4d90e2e4a808a]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09faac29ef385167c]
module.ecs_service_worker.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:service/exam-costa-staging-cluster/exam-costa-staging-worker]
module.network.aws_nat_gateway.main[0]: Refreshing state... [id=nat-0c0b9fa8d7946f84e]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d91fd33b6caef2b21080289494]
module.ecs_service_api.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:service/exam-costa-staging-cluster/exam-costa-staging-api]
aws_cloudwatch_metric_alarm.alb_unhealthy_targets[0]: Refreshing state... [id=exam-costa-staging-alb-unhealthy-targets]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:listener/app/exam-costa-staging-alb/62fe1bbf5714eb3c/1b4e0f353a2079d9]
aws_ssm_parameter.infra_output["sqs_queue_url"]: Refreshing state... [id=/exam-costa/staging/outputs/sqs_queue_url]
aws_ssm_parameter.infra_output["alb_url"]: Refreshing state... [id=/exam-costa/staging/outputs/alb_url]
aws_ssm_parameter.infra_output["ecs_cluster_name"]: Refreshing state... [id=/exam-costa/staging/outputs/ecs_cluster_name]
aws_ssm_parameter.infra_output["s3_bucket_name"]: Refreshing state... [id=/exam-costa/staging/outputs/s3_bucket_name]
aws_cloudwatch_dashboard.main[0]: Refreshing state... [id=exam-costa-staging]
aws_ssm_parameter.infra_output["worker_service_name"]: Refreshing state... [id=/exam-costa/staging/outputs/worker_service_name]
aws_ssm_parameter.infra_output["api_service_name"]: Refreshing state... [id=/exam-costa/staging/outputs/api_service_name]
aws_ssm_parameter.cloudwatch_dashboard_url[0]: Refreshing state... [id=/exam-costa/staging/outputs/cloudwatch_dashboard_url]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.self_signed will be created
  + resource "aws_acm_certificate" "self_signed" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + private_key               = (sensitive value)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-staging-self-signed-cert"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-staging"
        }
      + tags_all                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-staging-self-signed-cert"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-staging"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # aws_ssm_parameter.infra_output["alb_url"] will be updated in-place
  ~ resource "aws_ssm_parameter" "infra_output" {
        id             = "/exam-costa/staging/outputs/alb_url"
      + insecure_value = (known after apply)
        name           = "/exam-costa/staging/outputs/alb_url"
        tags           = {
            "CostCenter"  = "devops-exam"
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "/exam-costa/staging/outputs/alb_url"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-staging"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # tls_private_key.self_signed will be created
  + resource "tls_private_key" "self_signed" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.self_signed will be created
  + resource "tls_self_signed_cert" "self_signed" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + max_path_length       = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "exam-costa-staging.internal"
          + organization = "exam-costa"
        }
    }

  # module.alb.aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                                   = "arn:aws:elasticloadbalancing:us-east-2:371670420772:listener/app/exam-costa-staging-alb/62fe1bbf5714eb3c/1b4e0f353a2079d9"
        tags                                 = {
            "CostCenter"  = "devops-exam"
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-staging"
        }
        # (6 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "redirect"
            # (2 unchanged attributes hidden)

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ quick_access               = {
      ~ api_endpoint             = "http://exam-costa-staging-alb-1273312716.us-east-2.elb.amazonaws.com" -> "https://exam-costa-staging-alb-1273312716.us-east-2.elb.amazonaws.com"
      ~ health_endpoint          = "http://exam-costa-staging-alb-1273312716.us-east-2.elb.amazonaws.com/healthz" -> "https://exam-costa-staging-alb-1273312716.us-east-2.elb.amazonaws.com/healthz"
        # (3 unchanged attributes hidden)
    }

Error: Invalid count argument

  on ../../modules/alb/main.tf line 121, in resource "aws_lb_listener" "https":
 121:   count = var.certificate_arn != null ? 1 : 0

The "count" value depends on resource attributes that cannot be determined
until apply, so Terraform cannot predict how many instances will be created.
To work around this, use the -target argument to first apply only the
resources that the count depends on.
::error::Terraform exited with code 1.

```
</details>